Vanilla/init.org
#+TITLE: Emacs Init File
#+AUTHOR: Sidharth Arya

* Packages
  This is where i define the basic settings required for package management.
  #+BEGIN_SRC emacs-lisp :tangle init.el
    (add-to-list 'load-path "~/.emacs.d/packages/SidharthArya/emacsit")
    (require 'emacsit)
    (setq emacsit::savedir "/home/arya/.emacs.d/packages")
    (setq emacsit::packages  '(
                               jwiegley/use-package
                               SidharthArya/modules.el
                               ))
    (emacsit::load)
    (require 'use-package)
    (use-package emacsit-use-package
      :custom
      (use-package-ensure-function 'emacsit-use-package-ensure))

    (use-package modules
      :custom
      (modules-config-list '(
                             (none ())
                             (minimal (compile core appearance vi))
                             (mail (core mail emoji begin-mail not-org))
                             (news (core web org emoji begin-news not-org))
                             (tracking (core vi ivy org begin-tracking not-org))
                             (programming (compile core appearance vi ivy org programming vc))
                             (org (compile core appearance programming files vi org server web ivy projects finance begin-org core-post dashboard vc custom space))
                             (doom (begin-org doom))
                             (utilities (core pdf))
                             (main (compile coxcore appearance programming vi emoji ivy web org finance news mail server space workspace dashboard core-post))))
      (modules-config-default 'org)
      (modules-path "~/.emacs.d/lisp")
      :config
      (modules-command-line-args-process))
  #+END_SRC

* Core
  Everything that will always be a part of any emacs instance.
  #+BEGIN_SRC emacs-lisp :tangle lisp/core.el
    (setq my-temp-gc-cons-threshold gc-cons-threshold)
    (setq gc-cons-threshold most-positive-fixnum)
    (setq load-prefer-newer noninteractive)
    ;; Because file names shouldn't be handled at startup.
    (setq my-temp-file-name-handler-alist file-name-handler-alist)
    (setq file-name-handler-alist nil)

    (setq message-log-max 20)

    ;; UTF-8 support
    (set-charset-priority 'unicode)
    (prefer-coding-system 'utf-8)
    (setq locale-coding-system 'utf-8)
    (setq selection-coding-system 'utf-8)

    ;; Disable warnings from legacy advice system. They aren't useful, and what can
    ;; we do about them, besides changing packages upstream?
    (setq ad-redefinition-action 'accept)

    ;; A second, case-insensitive pass over `auto-mode-alist' is time wasted, and
    ;; indicates misconfiguration (or that the user needs to stop relying on case
    ;; insensitivity).
    (setq auto-mode-case-fold nil)

    (setq inhibit-startup-screen t
          inhibit-startup-message t
          inhibit-startup-echo-area-message user-login-name
          inhibit-default-init t
          initial-major-mode 'fundamental-mode
          initial-scratch-message nil)

    (advice-add #'display-startup-echo-area-message :override #'ignore)

    (setq idle-update-delay 1.5)

    ;; (setq auth-sources '("~/.config/authinfo.gpg"))

    (setq abbrev-file-name "~/.emacs.d/lisp/abbrev.el")
    (setq bookmark-default-file "~/.emacs.d/bookmarks")
    (setq custom-file "~/.emacs.d/lisp/custom.el"
          desktop-dirname              "~/.emacs.d/desktop"
          desktop-base-file-name       "autosave"
          desktop-base-lock-name       "autosave-lock"
          tramp-auto-save-directory    "~/.emacs.d/tramp-auto-save/"
          backup-directory-alist '(("" . "~/.emacs.d/backup"))
          tramp-backup-directory-alist backup-directory-alist
          tramp-persistency-file-name "~/.emacs.d/tramp")
    (setq delete-old-versions t
          version-control t)
    (setq enable-recursive-minibuffers t)
    (minibuffer-depth-indicate-mode)
    (fset 'yes-or-no-p 'y-or-n-p)
    (setq-default indent-tabs-mode nil)
    (set-register ?f '(file . "~/.emacs.d/init.org"))
    (menu-bar-mode -1)
    (tool-bar-mode -1)
    (scroll-bar-mode -1)
    (defvar my-documents-mounted nil)
                                            ;(global-so-long-mode +1)
    (set-frame-parameter nil 'alpha '(95 . 100))
    (set-frame-size nil 130 40)
    (set-frame-position nil 130 40)
    (setq custom-theme-directory "~/.emacs.d/themes")
    (load-theme 'doom-one t)
    (add-hook 'kill-emacs-hook 'save-some-buffers)

  #+END_SRC
  #+BEGIN_SRC emacs-lisp :tangle lisp/core-post.el
    (setq file-name-handler-alist my-temp-file-name-handler-alist)
    (setq gc-cons-threshold my-temp-gc-cons-threshold )
  #+END_SRC
* Appearance
  Mostly related to appearance.
  #+BEGIN_SRC emacs-lisp :tangle lisp/appearance.el
    (setq-default display-line-numbers-width-start t
                  display-line-numbers-grow-only t
                  display-line-numbers 'relative)
    (column-number-mode +1)
    (defun display-line-numbers-equalize ()
      "Equalize The width"
      (setq display-line-numbers-width (length (number-to-string (line-number-at-pos (point-max))))))
    (add-hook 'find-file-hook 'display-line-numbers-equalize)

  #+END_SRC
* Interface
  #+begin_src emacs-lisp :tangle lisp/ido.el
    (use-package ido
      :ensure t
      :custom
      (ido-use-filename-at-point 'guess)
      (ido-create-new-buffer 'always)
      (ido-file-extensions-order '(".py" ".org" ".txt"  ".emacs" ".xml" ".el" ".ini" ".cfg" ".cnf"))
      (ido-ignore-buffers '("\*.*\*"))
      (ido-ignore-directories '("\..*"))
      (ido-ignore-files '("\..*"))
      :config
      (ido-mode t))

  #+end_src
  #+begin_src emacs-lisp :tangle lisp/ivy.el
    (use-package swiper
      :ensure t
      :custom
      (ivy-use-virtual-buffers t)
      (ivy-height 15)
      (ivy-fixed-height-minibuffer t)
      (ivy-count-format "(%d/%d) ")
      :init
      (require 'counsel)
      (require 'ivy)
      :config 
      (ido-mode -1)
      (counsel-mode 1)
      (when (modules-loaded-p 'vi)
        (evil-define-command Grep (arg)
          (interactive "<a>")
          (counsel-rg arg))
        (evil-ex-define-cmd "G[rep]" 'Grep)
        (evil-ex-define-cmd "PlugInstall" 'emacsit::get)
        (evil-ex-define-cmd "PlugUpdate" 'emacsit::update-all))
      :bind 
      ("C-s" . swiper)
      ("C-x b" . counsel-switch-buffer)
      ("M-x" . counsel-M-x)
      ("C-x C-f" . counsel-find-file)
      ("C-x C-d" . counsel-dired)
      ("M-y" . counsel-yank-pop)
      ("<f1> f" . counsel-describe-function)
      ("<f1> v" . counsel-describe-variable)
      ("<f1> l" . counsel-find-library)
      ("<f2> i" . counsel-info-lookup-symbol)
      ("<f2> u" . counsel-unicode-char)
      ("<f2> j" . counsel-set-variable)
      ("C-x b" . ivy-switch-buffer)
      ("C-c v" . ivy-push-view)
      ("C-c V" . ivy-pop-view)
      )
  #+end_src
  #+begin_src emacs-lisp :tangle lisp/vi.el
    (use-package evil
      :ensure t
      :ensure emacs-evil/evil-collection
      :ensure noctuid/annalist.el
      :defer nil
      :custom
      (evil-want-keybinding nil)
      :config
      (require 'evil-collection)
      (evil-collection-init)
      (evil-mode +1))
  #+end_src
  #+begin_src emacs-lisp :tangle lisp/emoji.el
    (use-package emojify
      :ensure t
      :config
      (global-emojify-mode +1))
  #+end_src
  #+begin_src emacs-lisp :tangle lisp/space.el
    (bind-keys
     :prefix-map space-prefix
     :prefix "M-SPC")
    (when (modules-loaded-p 'org)
      (bind-keys
       :prefix-map org-prefix
       :prefix "M-SPC o"
       ("a" . org-agenda)
       ("c" . org-capture)))

    (bind-keys
     :prefix-map file-prefix
     :prefix "M-SPC f"
     ("f" . find-file)
     ("r" . counsel-recentf))
    (when (modules-loaded-p 'projects)
      (define-key global-map (kbd "M-SPC p") 'projectile-command-map)
      (bind-keys :map projectile-command-map
                 ("p" . counsel-projectile-switch-project) 
                 ("f" . counsel-projectile-find-file) 
                 ("d" . counsel-projectile-find-dir)))

    (bind-keys
     :prefix-map buffer-prefix
     :prefix "M-SPC b"
     ("b" . counsel-switch-buffer)
     ("n" . counsel-switch-buffer)
     ("B" . ibuffer))
    (evil-define-key 'normal 'global (kbd "SPC") 'space-prefix)
    (evil-define-key 'normal 'dashboard-mode-map (kbd "SPC") 'space-prefix)
  #+end_src
* Programming
  #+begin_src emacs-lisp :tangle lisp/programming.el
    (use-package ide-mode
      :ensure SidharthArya/emacs-ide-mode
      :config
      (require 'ide-mode-recipes)
      :bind
      (:map prog-mode-map
            ("C-S-i" . ide-mode))
      (:map ide-mode-map
            ("C-S-z" . ide-goto-shell)
            ("C-S-c" . ide-mode-compile)
            ("C-S-e" . ide-mode-execute)
            ("C-S-x" . ide-goto-input)
            ("C-S-s" . ide-goto-output)
            ("C-S-a" . ide-goto-code)))
    (use-package yasnippet
      :ensure t
      :ensure yasnippet-snippets
      :hook (prog-mode . yas-minor-mode)
      :config
      (require 'yasnippet-snippets))
    (use-package company
      :ensure t
      :hook (prog-mode . company-mode)
      :init
      (require 'company-tng)
      :bind
      (:map prog-mode-map
            ("TAB" . company-indent-or-complete-common)))

    (use-package flycheck
      :ensure t
      :hook (prog-mode . flycheck-mode))
  #+end_src
  #+begin_src emacs-lisp :tangle lisp/vc.el
    (use-package magit
      :ensure t
      :bind
      ("C-x g" . magit))

  #+end_src
* Mounts
  #+BEGIN_SRC emacs-lisp :tangle lisp/mount.el
    (setq my-documents-mounted (equal 1 (string-to-number (shell-command-to-string "mount | grep Documents | wc -l"))))
    (defun my-documents-mount()
      (if  (not my-documents-mounted)
          (if (y-or-n-p "Do you want to mount Secrets?" )
              (progn
                (shell-command "gocryptfs --extpass 'zenity --password' ~/Private/Drive/Personal ~/Documents" nil)
                (setq my-documents-mounted (equal 1 (string-to-number (shell-command-to-string "mount | grep Secret | wc -l"))))))))
    (my-documents-mount)


  #+END_SRC
* Dashboard
  #+BEGIN_SRC emacs-lisp :tangle lisp/dashboard.el
    (use-package dashboard
      :ensure t
      :custom
      (dashboard-center-content t)
      (dashboard-startup-banner 'logo)
      (dashboard-page-separator "\n\n")
      (dashboard-org-agenda-categories '("Tasks" "Appointments" "Books" "Movies" "Bills"))
      (dashboard-items '(
                         (agenda . -1)
                         (recents  . 5)
                         (bookmarks . 5)
                         (registers . 5)))
      :config (dashboard-setup-startup-hook))
  #+END_SRC
