Vanilla/init.org
* Organise
  #+BEGIN_SRC emacs-lisp :tangle lisp/org.el
    (modules-load '(mount))
    (use-package org
      :if my-documents-mounted
      :ensure alphapapa/ts.el
      :ensure t
      ;; :ensure sabof/org-bullets
      :ensure ht
      ;; :ensure SidharthArya/org-alert
      :ensure s
      :ensure emacsorphanage/ov
      :ensure f
      :ensure transient
      :ensure emacsmirror/peg
      :ensure alphapapa/org-ql
      :ensure alphapapa/org-sidebar
      :ensure alphapapa/org-super-agenda
      :ensure Kungsgeten/org-brain
      :ensure org-drill
      :ensure kaushalmodi/ox-hugo
      :hook (org-mode . visual-line-mode)
      (org-mode . auto-save-mode)

      :custom
      (org-agenda-skip-deadline-if-done t)
      (org-agenda-skip-scheduled-if-done t)
      (org-agenda-window-setup 'current-window)
      (org-babel-load-languages '((emacs-lisp . t)))
      (org-agenda-diary-file "~/Documents/Org/diary")
      (diary-file "~/Documents/Org/diary")
      (org-log-into-drawer t)
      (org-agenda-include-diary t)
      (alert-default-style 'libnotify)
      (org-alert-notification-title "Organizer")
      (org-directory "~/Documents/Org")
      (org-agenda-files '("~/Documents/Org/Agenda/notes.org" "~/Documents/Org/Agenda/habits.org" "~/Documents/Org/Agenda/timetable.org"))
      (org-super-agenda-groups
       '((:name "Diary"
                :category "Diary"
                :order 1)
         (:name "Unimportant"
                :priority "C"
                :tag "unimportant"
                :order 6)
         (:name "Deadlines"
                :deadline t
                :order 2)
         (:name "Started"
                :todo "STARTED"
                :order 3)
         (:name "Important"
                :priority "A"
                :tag "important"
                :tag "bill"
                :order 4)
         (:name "Habit"
                :habit t
                :order 7)
         (:name "Personal"
                :tag ("movies" "tvshows" "tvseries" "books")
                :order 9)
         (:name "Overdue"
                :deadline past
                :scheduled past
                :order 5)))
      (org-agenda-custom-commands
       '(("e" "Exercises" agenda  ""
          ((org-agenda-files (list "~/Documents/Org/Agenda/exercises.org"))
           (org-super-agenda-groups
            '((:auto-category t)))
           (org-agenda-sorting-strategy '(priority-up effort-down))))))
      (org-brain-path "~/Documents/Org/Brain")
      (org-id-track-globally t)
      (org-id-locations-file "~/Documents/Org/.org-id-locations")
      (org-capture-templates
       '(("i" "Important" entry (file+headline "~/Documents/Org//Agenda/notes.org" "Tasks")
          "* TODO %?\t:important:\n\tSCHEDULED:%(org-insert-time-stamp (org-read-date nil t \"\"))\n  %i\n  %a")
         ("u" "Unimportant" entry (file+headline "~/Documents/Org//Agenda/notes.org" "Tasks")
          "* TODO %?\t:unimportant:\n\tSCHEDULED:%(org-insert-time-stamp (org-read-date nil t \"Sun\"))\n  %i\n  %a")
         ("j" "Journal" entry (file+datetree "~/org/journal.org")
          "* %?\nEntered on %U\n  %i\n  %a")
         ("D" "Diary")
         ("Dd" "Daily Diary" entry (file+headline "~/Documents/Org/Brain/Personal/Diaries.org" "Diary")
          "* %(org-insert-time-stamp (org-read-date nil t \"\"))\n %?")
         ("Ds" "Sleep Journal" entry (file+headline "~/Documents/Org/Brain/Personal/Diaries.org" "Sleep")
          "* %(org-insert-time-stamp (org-read-date nil t \"\"))\n %?")
         ("Dr" "Regret" entry (file+headline "~/Documents/Org/Brain/Personal/Diaries.org" "Regrets")
          "* %?")
         ("P" "Protocol")
         ("Pc" "Protocol Text" entry (file+headline "~/Documents/Org/Agenda/notes.org" "Protocol")
          "* %^{Title}\nSource: %u, %c\n #+BEGIN_QUOTE\n%i\n#+END_QUOTE\n\n\n%?")
         ("Pl" "Protocol Link" entry (file+headline "~/Documents/Org/Agenda/notes.org" "Inbox")
          "* %? [[%:link][%:description]] \nCaptured On: %U")))
      :bind
      ("C-c c" . org-capture)
      ("C-c a" . org-agenda)
      ("C-c l" . org-store-link)
      ("C-c b" . org-switchb)
      ("C-c B" . counsel-brain)
      (:map org-mode-map
            ("C-c t" . org-sidebar-toggle))
      :init
      (setq org-version "9999")
      (require 'org-super-agenda)
      (require 'org-ql)
      (require 'org-ql-search)
      (require 'org-sidebar)
      (require 'org-tempo)
      (org-super-agenda-mode)
      :config
      (require 'org-archive)
      (require 'org-clock)
      (require 'ox-hugo)
      (require 'org-hugo-auto-export-mode)
      (defun org-hugo-new-subtree-post-capture-template ()
        "Returns `org-capture' template string for new Hugo post.
          See `org-capture-templates' for more information."
        (let* ((title (read-from-minibuffer "Post Title: ")) ;Prompt to enter the post title
               (fname (org-hugo-slug title)))
          (mapconcat #'identity
                     `(,(concat "* TODO " title)
                       ":PROPERTIES:"
                       ,(concat ":EXPORT_FILE_NAME: " fname)
                       ":END:"
                       "%?\n")          ;Place the cursor here finally
                     "\n")))

      (add-to-list 'org-capture-templates
                   '("b"                ;`org-capture' binding + h
                     "Blog post"
                     entry
                     ;; It is assumed that below file is present in `org-directory'
                     ;; and that it has a "Blog Ideas" heading. It can even be a
                     ;; symlink pointing to the actual location of all-posts.org!
                     (file+olp "~/Documents/Org/Blog/posts.org" "Blog")
                     (function org-hugo-new-subtree-post-capture-template)))
      (setq-default org-confirm-babel-evaluate nil)
      (require 'org-habit)
      (require 'org-brain)
      (require 'org-drill)
      (require 'cl))
  #+END_SRC
  #+begin_src emacs-lisp :tangle lisp/begin-org.el
    (set-frame-parameter nil 'title "Org")
  #+end_src
  #+begin_src emacs-lisp :tangle lisp/not-org.el
    (global-set-key (kbd "C-c c") #'(lambda () (interactive) (start-process-shell-command "*Capture*" nil "emacsclient --eval '(org-capture)'")))
    (global-set-key (kbd "C-c a") #'(lambda () (interactive) (start-process-shell-command "*Agenda*" nil "emacsclient --eval '(org-agenda)'")))

  #+end_src
* Finance
  #+begin_src emacs-lisp :tangle lisp/finance.el
    (use-package ledger-mode
      :ensure ledger/ledger-mode
      :mode ".ledger")
  #+end_src
* Files
  #+begin_src emacs-lisp :tangle lisp/files.el
    (use-package dired
      :custom
      (dired-listing-switches "-alh -v --group-directories-first")
      (dired-actual-switches "-alh -v --group-directories-first"))
  #+end_src
* Notifications
  #+begin_src emacs-lisp :tangle lisp/notifications.el
    (use-package alert
      :ensure t)
  #+end_src
* Workspaces
  #+begin_src emacs-lisp :tangle lisp/workspace.el
    (use-package perspective
      :ensure nex3/perspective-el
      :config
      (persp-mode))
  #+end_src
* Web
  #+begin_src emacs-lisp :tangle lisp/web.el
    (use-package browse-rules
      :ensure SidharthArya/browse-rules.el
      :custom
      (browse-url-browser-function 'browse-rules-url)
      (browse-rules '(
                      (".*" t "firefox" "%s")
                      (".*thehindu.*" t "firefox" "about:reader?url=%s"))))
  #+end_src
* Mail
  #+begin_src emacs-lisp :tangle lisp/mail.el
    (use-package gnus
      :ensure t
      :custom
      (gnus-home-directory "~/Private/News/Gnus")
      (gnus-default-directory "~/Private/News/Gnus")
      (gnus-directory "~/Private/News/Gnus/News")
      (gnus-agent-directory "~/Private/News/Gnus/News/agent")
      (gnus-cache-directory "~/Private/News/Gnus/News/cache")
      (gnus-article-save-directory "~/Private/News/Gnus/News")
      (gnus-kill-files-directory "~/Private/News/Gnus/News")
      (message-directory "~/Private/News/Gnus/Mail")
      (nnfolder-directory "~/Private/News/Gnus/Mail/archive")
      (user-mail-address "sidhartharya10@gmail.com")
      (user-full-name "Sidharth Arya")
      (smtpmail-smtp-server "smtp.gmail.com")
      (smtpmail-smtp-service 587)
      (shr-use-colors nil)
      (shr-use-fonts nil)
      (gnus-ignored-newsgroups "^to\\.\\|^[0-9. ]+\\( \\|$\\)\\|^[\"]\"[#'()]")
                                            ; Adaptive scoring
      (nnheader-file-name-translation-alist '((?[ . ?_) (?] . ?_)) )
      (gnus-select-method
       '(nnimap "Gmail"
                (nnimap-address "imap.gmail.com")
                (nnimap-server-port "imaps")
                (nnimap-stream ssl))
       (nnir-search-engine imap))
      (gnus-secondary-select-methods '((nntp "news.gwene.org")))
      :init
      (require 'nnir)
      (add-hook 'gnus-after-getting-new-news-hook 'gnus-notifications)
      :config
      (gnus-demon-add-handler 'gnus-demon-scan-news 2 t)
      (gnus-demon-init))

    (add-to-list 'kill-emacs-hook 'gnus-group-exit)
    (use-package gnus-desktop-notify
      :ensure https://gitlab.com/wavexx/gnus-desktop-notify.el
      :config
      (gnus-desktop-notify-mode)
      (gnus-demon-add-scanmail))
  #+end_src
  #+begin_src emacs-lisp :tangle lisp/begin-mail.el
    (set-frame-parameter nil 'title "Mail")
    (gnus)
    (add-hook 'after-make-frame-functions (lambda (&optional frame) (switch-to-buffer "*Group*")))
  #+end_src
* Projects
  #+begin_src emacs-lisp :tangle lisp/projects.el
    (use-package projectile
      :ensure bbatsov/projectile
      :ensure pkg-info
      :config
      (projectile-mode +1))

    (when (modules-loaded-p 'ivy)
      (use-package counsel-projectile
        :ensure ericdanan/counsel-projectile))
  #+end_src
* TODO News
  #+begin_src emacs-lisp :tangle lisp/news.el
    (modules-load '(mount))
    (use-package elfeed
      :if my-documents-mounted
      :ensure t
      :ensure remyhonig/elfeed-org
      :custom
      (elfeed-db-directory "~/Private/News/Feeds")
      (browse-url-generic-program "firefox")
      (rmh-elfeed-org-files (list "~/Documents/Org/Feeds/feeds.org"))
      (elfeed-sort-order 'descending)
      :init
      (require 'elfeed-org)
      (elfeed-org)

      :config
      (setq-default elfeed-search-filter  (if
                                              (<= (string-to-number (format-time-string "%u")) 5)
                                              "@2-days-ago -unimportant +unread +important"
                                            "@1-week-ago +unread +important"))
                                            ; (start-process "*Youtube*" nil "/home/arya/.local/scripts/elfeed-youtube" "get")
                                            ; (start-process "*Mpv*" nil "/home/arya/.local/scripts/elfeed-youtube" "vlc")
      (add-to-list 'kill-emacs-hook 'elfeed-db-unload)

      (defun my-elfeed-feed-sort (a b)
        (let* ((a-tags (format "%s" (elfeed-entry-feed a)))
               (b-tags (format "%s" (elfeed-entry-feed b))))
          (if (string= a-tags b-tags)
              (< (elfeed-entry-date b) (elfeed-entry-date a)))
          (string< a-tags b-tags)))
      ;;(setf elfeed-search-sort-function #'my-elfeed-feed-sort)


            ;;; HOOKS
      (add-hook 'elfeed-new-entry-hook
                (elfeed-make-tagger  :entry-title '"ASL Video Series"
                                     :add 'junk
                                     :remove 'unread))


      (add-hook 'elfeed-new-entry-hook
                (elfeed-make-tagger  :entry-title '"Dr. Pimple Popper"
                                     :add 'junk
                                     :remove 'unread)))
    (run-at-time "04:00am" 600 'elfeed-db-save)
  #+end_src
  #+begin_src emacs-lisp :tangle lisp/begin-news.el
    (set-frame-parameter nil 'title "News")
    (add-to-list 'kill-emacs-hook 'elfeed-db-unload)
    (set-process-sentinel (start-process-shell-command "*ELFEED*" "*ELFEED LOG*" "emacs --script ~/.emacs.d/scripts/elfeed") 'my-elfeed-sentinel)


    (defun my-elfeed-sentinel (name status)
      "NAME STATUS."
      (message "%s %s" name status)
      (modules-load '(news))
      (elfeed)
      (switch-to-buffer "*elfeed-search*"))
  #+end_src
