Vanilla/init.org
* Tracking
  #+begin_src emacs-lisp :tangle lisp/tracking.el
    (modules-load '(mount))
    (load "~/Documents/Org/Personal/tracking.el")
    (defvar my-tracking-drill-prefix "~/Documents/Org/Brain")
    (setq org-drill-maximum-items-per-session nil)
    (setq org-drill-maximum-duration nil)
    (load "~/Documents/Org/Drill/drill.el")
    (defun my-tracking-drill-stuff ()

      ""
      (interactive)
      (save-excursion
        (let  ((org-drill-scope (mapcar (lambda (a) (format "%s/%s" my-tracking-drill-prefix a)) my-tracking-drill-files)))
          (dolist (x (buffer-list)) (with-current-buffer x (condition-case nil (recover-this-file) (error nil))))(org-drill)(dolist (x (buffer-list)) (with-current-buffer x (condition-case nil (recover-this-file) (error nil)))))))

    (defun my-tracking-do-the-writeup ()
      ""
      (interactive)
      (with-current-buffer (find-file-noselect my-tracking-writeup-file)
        (end-of-buffer)
        (if (not (equal (org-time-string-to-absolute (org-get-heading t t t t)) (time-to-days (org-read-date nil t ""))))
            (let ((temp ""))

              (setq temp (concat temp "\n"))
              (dolist
                  (handle my-tracking-writeup-handles)
                (setq temp (concat temp (format "- [ ] %s :%s\n" handle (read-string (concat handle ": "))))))
              (setq temp (concat temp (insert "\n"))
                    )
              (insert "* ")
              (org-insert-time-stamp (org-read-date nil t ""))
              (insert temp)))
        (save-buffer)
        (kill-current-buffer)))

    (defun my-tracking-do-check-writeup ()
      ""
      (interactive)
      (switch-to-buffer (find-file-noselect my-tracking-writeup-file))
      (org-show-all)
      (end-of-buffer)
      (org-narrow-to-subtree))
    (defun my-tracking-do-check-emotions ()
      ""
      (interactive)
      (switch-to-buffer (find-file-noselect "~/Documents/Org/Brain/Me/Exercises.org")
                        (end-of-buffer)))
    (setq my-tracking-points-directory "~/Documents/Org/Tracking/")
    (defun my-tracking-do-give-points ()
      ""
      (interactive)
      (if (equal (format-time-string "%a" (current-time)) "Sun")
          (dolist (key my-tracking-point-keys-weekly)
            (my-tracking-give-points (symbol-name key))))
      (if (equal (string-to-number (format-time-string "%d" (current-time))) 1)
          (dolist (key my-tracking-point-keys-monthly)
            (my-tracking-give-points (symbol-name key))))
      (dolist (key my-tracking-point-keys-daily)
        (my-tracking-give-points (symbol-name key))))

    (defun my-tracking-give-points(str)
      ""
      (with-current-buffer (find-file-noselect (concat  my-tracking-points-directory str ".csv"))
        (if (equal (buffer-size) 0)
            (insert "Date,Value"))
        (end-of-buffer)
        (if (not (equal (car (split-string (thing-at-point 'line) ","))  (format-time-string "%d-%m-%Y" (current-time))))
            (progn
              (let ((input (read-string (concat (string-trim-right (capitalize (buffer-name)) ".csv") ": "))))
                (insert "\n")
                (insert "")
                (insert (format-time-string "%d-%m-%Y" (current-time)))
                (insert "," input)
                (save-buffer)
                (kill-buffer))))))
    (defun my-tracking-do-plot-charts ()
      ""
      (start-process-shell-command "*Charts*" "*Charts*" "python ~/.local/scripts/charts.py"))

    (defvar my-morning-tracking-functions '(my-tracking-do-the-writeup
                                            my-tracking-drill-stuff))
    (setq my-night-tracking-functions '(my-tracking-do-check-writeup
                                        my-tracking-do-give-points
                                        my-tracking-do-plot-charts
                                        my-tracking-drill-stuff
                                        my-tracking-do-check-emotions
                                        ))

    (defun do-tasks (arg)
      ""
      (interactive)
      (dolist (task arg)
        (funcall task)))
    (defun my-morning-tasks ()
      ""
      (interactive)
      (do-tasks my-morning-tracking-functions))
    (defun my-night-tasks ()
      ""
      (interactive)
      (do-tasks my-night-tracking-functions))
    (if my-documents-mounted
        (progn
          (run-at-time "04:00am" nil #'my-morning-tasks)
          (run-at-time "08:00pm" nil #'my-night-tasks)))
  #+end_src
  #+begin_src emacs-lisp :tangle lisp/begin-tracking.el
    (modules-load '(tracking))
    (set-frame-parameter nil 'title "Tracking")
    (defun after-tracking-task ()
      ""
      (interactive)
      (if (y-or-n-p "Are you done with you Tasks?")
          (save-buffers-kill-terminal)))
    (advice-add 'my-morning-tasks :after 'after-tracking-task)
    (advice-add 'my-night-tasks :after 'after-tracking-task)

  #+end_src
* Utilities
  #+begin_src emacs-lisp :tangle lisp/pdf.el
    (use-package pdf-tools
      :ensure t
      :config
      (require 'pdf-occur)
      (require 'pdf-history)
      (require 'pdf-annot)
      (require 'pdf-links)
      (require 'pdf-outline)
      (require 'pdf-sync)
      (pdf-tools-install))
  #+end_src
* Config Compile
  #+BEGIN_SRC emacs-lisp :tangle lisp/compile.el
    (defun config-compile()
      "Compile all my configurations"
      (interactive)
      (delete-file "~/.emacs.d/init.el")
      (org-babel-tangle-file "~/.emacs.d/init.org"))
  #+END_SRC
* MELPA
  This is just to make debug packages for melpa
  #+begin_src emacs-lisp :tangle lisp/melpa.el
    (require 'package)
    (let* ((no-ssl (and (memq system-type '(windows-nt ms-dos))
                        (not (gnutls-available-p))))
           (proto (if no-ssl "http" "https")))
      (when no-ssl (warn "\
    Your version of Emacs does not support SSL connections,
    which is unsafe because it allows man-in-the-middle attacks.
    There are two things you can do about this warning:
    1. Install an Emacs version that does support SSL and be safe.
    2. Remove this warning from your init file so you won't see it again."))
      (add-to-list 'package-archives (cons "melpa" (concat proto "://melpa.org/packages/")) t)
      ;; Comment/uncomment this line to enable MELPA Stable if desired.  See `package-archive-priorities`
      ;; and `package-pinned-packages`. Most users will not need or want to do this.
      ;;(add-to-list 'package-archives (cons "melpa-stable" (concat proto "://stable.melpa.org/packages/")) t)
      )
    (package-initialize)
    (use-package package-build
      :ensure melpa/melpa)
    (use-package package-lint
      :ensure purcell/package-lint)
  #+end_src
* Server
  #+begin_src emacs-lisp :tangle lisp/server.el
    (server-start)
  #+end_src

* Distributions
  #+begin_src emacs-lisp :tangle lisp/doom.el
    (setq user-emacs-directory "~/.emacs.d/doom")
    (load "~/.emacs.d/doom/init.el")

  #+end_src
* Help
  #+begin_src emacs-lisp :tangle lisp/help.el
    (use-package helpful
      :ensure Wilfred/helpful
      :ensure dash
      :ensure Wilfred/elisp-refs
      :ensure Wilfred/loop.el)
  #+end_src
* TODO doom-initialize
  
